InformationRegisters/ОценкиКандидатовПоХарактеристикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОценкиКандидатовПоХарактеристикам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныеДанныеКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФизическиеЛицаКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФизическиеЛицаКандидатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛичныеДанныеКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОценкиКандидатовПоХарактеристикам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Кандидат", "ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

Функция ЗаполнитьКандидатов() Экспорт

	Если Метаданные.РегистрыСведений.ОценкиКандидатовПоХарактеристикам.Реквизиты.Найти(
		"УдалитьФизическоеЛицо") = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.ОценкиКандидатовПоХарактеристикам.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1000
			|	ОценкиКандидатовПоХарактеристикам.Кандидат,
			|	ОценкиКандидатовПоХарактеристикам.УдалитьФизическоеЛицо,
			|	ЕСТЬNULL(ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата,
			|		ЗНАЧЕНИЕ(Справочник.ЛичныеДанныеКандидатов.ПустаяСсылка)) КАК ЛичныеДанныеКандидата
			|ИЗ
			|	РегистрСведений.ОценкиКандидатовПоХарактеристикам КАК ОценкиКандидатовПоХарактеристикам
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
			|		ПО ОценкиКандидатовПоХарактеристикам.УдалитьФизическоеЛицо = ФизическиеЛицаКандидатов.ФизическоеЛицо
			|ГДЕ
			|	ОценкиКандидатовПоХарактеристикам.ЛичныеДанныеКандидата = ЗНАЧЕНИЕ(Справочник.ЛичныеДанныеКандидатов.ПустаяСсылка)
			|	И ОценкиКандидатовПоХарактеристикам.УдалитьФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		КоличествоОбработанныхЗаписей = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЛичныеДанныеКандидата) Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ОценкиКандидатовПоХарактеристикам.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Кандидат.Установить(ВыборкаДетальныеЗаписи.Кандидат);
			НаборЗаписей.Прочитать();
			Для каждого ТекущаяЗапись Из НаборЗаписей Цикл
				ТекущаяЗапись.ЛичныеДанныеКандидата = ВыборкаДетальныеЗаписи.ЛичныеДанныеКандидата;
				КоличествоОбработанныхЗаписей = КоличествоОбработанныхЗаписей + 1;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей, Истина);
			
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		
		Возврат КоличествоОбработанныхЗаписей = 0;
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка заполнения кандидатов в регистре Оценки кандидатов по характеристикам'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ОценкиКандидатовПоХарактеристикам);
		Возврат Ложь;
	КонецПопытки;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
